stress_script.yml
config:
  target: 'http://localhost:3001'
  phases:
    - duration: 30
      arrivalRate: 30
scenarios:
- flow:
    - loop:
      - get:
          url: "/amenities/{{ $loopElement }}"
      over:
        - 9999999
        - 6345343
        - 5234534
        - 5
        - 5
        - 5
        - 8123236
        - 864325
        - 86
        - 8324326
        - 86
        - 8632443
        - 86
        - 86
        - 86
        - 862332
        - 86
        - 86
        - 8682375
        - 123
        - 1243253
        - 1233456
        - 1232345
        - 1233453
        - 1233456
        - 1232345
        - 123
        - 123
        - 2323454
        - 1232345
        - 123
        - 123
        - 3432453
        - 123
        - 123
        - 123
        - 4621434
        - 46214
        - 46214
        - 46214
        - 4621454
        - 4621464
        - 46214
        - 9999934
        - 9999956
        - 9999945
        - 9999935
        - 9999943
        - 9999945
        - 9999965
        - 9999934
        - 9999934
        - 9999965
        - 9999965
        - 9999945
        - 9999987
        - 9999967
        - 9999987
        - 9999956
        - 9999957
        - 9999945
        - 1234564
        - 123
        - 123
        - 123
        - 1233456
        - 123
        - 123
        - 123
        - 1235345
        - 123
        - 123
        - 123
        - 1236544
        - 48498
        - 4849854
        - 48498
        - 48498
        - 48498
        - 4849834
        - 48498
        - 48498
        - 4849854
        - 48498
        - 4849865
        - 48498
        - 48498
        - 4849834
        - 48498
        - 48498
        - 4849834
        - 48498
        - 4849825
        - 4849865
        - 48498
        - 48498
        - 1
        - 1768667
        - 14564
        - 145
        - 26
        - 2623435
        - 265467
        - 26
        - 2645674
        - 2645
        - 26
        - 26
        - 26345
        - 26
      count: 30